In [1]:
%load_ext sql
%reload_ext sql
%sql sqlite://

In [2]:
%%sql
CREATE TABLE Worker (
WORKER_ID INT,
FIRST_NAME CHAR(25),
LAST_NAME CHAR(25),
SALARY INT(15),
JOINING_DATE DATETIME,
DEPARTMENT CHAR(25)
);

 * sqlite://
Done.

[]

In [3]:
%%sql
INSERT INTO Worker VALUES(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR');
INSERT INTO Worker VALUES(2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin');
INSERT INTO Worker VALUES(3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR');
INSERT INTO Worker VALUES(4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin');
INSERT INTO Worker VALUES(5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin');
INSERT INTO Worker VALUES(6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account');
INSERT INTO Worker VALUES(7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account');
INSERT INTO Worker VALUES(8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Q-13. Write an SQL query to show only odd rows from aÂ table.

In [4]:
%%sql
select * from worker where WORKER_ID%2 !=0

 * sqlite://
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account')]

#### Q-14. Write an SQL query to clone a new table from another table.

In [16]:
%%sql
CREATE TABLE CloneWorker (
WORKER_ID INT PRIMARY KEY,
FIRST_NAME VARCHAR(50),
LAST_NAME VARCHAR(50),
SALARY INT,
DEPARTMENT VARCHAR(50),
JOINING_DATE DATETIME);

 * sqlite://
Done.

[]

In [18]:
%%sql
INSERT INTO CloneWorker SELECT * FROM Worker

 * sqlite://
8 rows affected.

[]

In [20]:
%%sql
select * from CloneWorker

 * sqlite://
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]